Revit 2026 API

# BlendTopSketch Property

---

Returns the Top Sketch of the Blend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch TopSketch { get; }
```
```vb
Public ReadOnly Property TopSketch As Sketch
	Get
```
```cpp
public:
property Sketch^ TopSketch {
	Sketch^ get ();
}
```
```fsharp
member TopSketch : Sketch with get
```

#### Property Value

Sketch

This property is used to retrieve the Top Sketch of the Blend.

#### Reference

Blend Class

Autodesk.Revit.DB Namespace